## Student Data Analysis

In this activity, you will use the steps below to analyze a dataset of student test scores from schools in a fake school district.

1. Collect the data.

2. Prepare the data.

3. Summarize the data. 

4. Drill down into the data. 

5. Make comparisons.

In [3]:
import pandas as pd

import os

In [4]:
#The path to the file is built by using os.path.join. (2 points)

student_data = os.path.join('..','School_District_Analysis','Resources', 'new_full_student_data.csv')

In [5]:
#The DataFrame is created and named student_df. (2 points)

student_df = pd.read_csv(student_data)

In [6]:
#The first five rows of data are displayed. (1 points)
 
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [7]:
#After the removal of null values, isna().sum() displays 0 for all the columns. (5 points)

student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [8]:
student_df = student_df.drop_duplicates()

In [9]:
#The column types are displayed. (5 points)

student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [11]:
#The "th" suffix is removed from all the values in the "grade" column. (5 points)

student_df["grade"] = student_df["grade"].str.replace("th", "")

student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [13]:
#The "grade" column is successfully converted to an int type. (5 points)

student_df['grade'] = student_df["grade"].astype("int64")

student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [14]:
#The summary statistics for the DataFrame are displayed. (6 points)

student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [15]:
#The mean of the "math_score" column is displayed. (7 points)

student_df["math_score"].mean()

64.67573326141189

In [16]:
#The minimum of the "reading_score" column is stored in min_reading_score. (7 points)

min_reading_score = student_df["reading_score"].min()
min_reading_score

10.5

In [ ]:
#The "grade" column is displayed. (4 points)

filter = student_df["grade"] > 8
student_df.loc[filter]["grade"]

In [ ]:
#The first three rows of Columns 3, 4, and 5 are displayed. (4 points)

student_df.iloc[0 : 3, [3, 4, 5]]

In [ ]:
#The summary statistics for 9th graders are displayed. (4 points)

student_nine_df = student_df.loc[(student_df["grade"] == 9)]
student_nine_df.describe()

In [ ]:
#The row that contains the minimum reading score is displayed. (4 points)

min_reading_row = student_df.loc[(student_df["reading_score"] <= min_reading_score)]
min_reading_row

In [ ]:
#The reading scores of the 10th graders at Dixon High School is displayed. (4 points)

student_dixon_df = student_df.loc[(student_df["school_name"] == "Dixon High School") & (student_df["grade"] == 10)]
student_dixon_df.loc[:,["school_name", "reading_score"]]

In [ ]:
#The average reading score of all the students in Grades 11 and 12 combined is calculated. (5 points)

student_11_12_df = student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12)]

student_11_12_df["reading_score"].mean()

In [ ]:
#The average budget for each school type is displayed. (7 points)

student_school_df = student_df.groupby(by = "school_type").mean()
student_school_df.loc[:, ["school_budget"]]

In [ ]:
#The total number of students per school is displayed in descending order. (6 points)

students_per_school_df = student_df.groupby(["school_name"]).count()

students_per_school_df.iloc[:,0:1].sort_values("student_id", ascending = False)

In [ ]:
#The average math scores for each combination of grade and school type are displayed. (7 points)
 
student_summary_df = student_df.groupby(["school_type","grade"]).mean()
student_summary_df.iloc[:,[1,2]]

In [ ]:
#Using the provided testing data for PyCity Schools, we were asked 
#to perform various types of analysis using Pandas on a .csv file.

#Output was to be filtered and formatted using a variety of methods 
#such as loc and iloc, and various conditional statements.

#This was an interesting project, in that there were multiple ways 
#to do many of the required operations. I found the practice of doing 
#the operation with both loc and iloc to be very helpful in understanding 
#their attributes. Additionally, the speed with which Pandas is able to 
#slice lots of data is impressive.

#This exposure to Python and Pandas has opened a potential door for me. 
#Building on this exposure I see how it is possible to use data gathered 
#in the real world by inexpensive sensors to glean insights into vehicle 
#dynamics. I look forward to discovering the many wonderful libraries 
#there are to explore.